CSI API ETABS v1
cCaseStaticNonlinearStaged.GetResultsSaved Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetResultsSaved(
	string Name,
	ref int StagedSaveOption,
	ref int StagedMinSteps,
	ref int StagedMinStepsTD
)
Function GetResultsSaved (
	Name As String,
	ByRef StagedSaveOption As Integer,
	ByRef StagedMinSteps As Integer,
	ByRef StagedMinStepsTD As Integer
) As Integer
Dim instance As cCaseStaticNonlinearStaged
Dim Name As String
Dim StagedSaveOption As Integer
Dim StagedMinSteps As Integer
Dim StagedMinStepsTD As Integer
Dim returnValue As Integer
returnValue = instance.GetResultsSaved(Name,
	StagedSaveOption, StagedMinSteps,
	StagedMinStepsTD)
int GetResultsSaved(
	String^ Name,
	int% StagedSaveOption,
	int% StagedMinSteps,
	int% StagedMinStepsTD
)
abstract GetResultsSaved :
        Name : string *
        StagedSaveOption : int byref *
        StagedMinSteps : int byref *
        StagedMinStepsTD : int byref -> int
Parameters
Name
Type: System.String
StagedSaveOption
Type: System.Int32
StagedMinSteps
Type: System.Int32
StagedMinStepsTD
Type: System.Int32
Return Value
Type: Int32
See Also
Reference
cCaseStaticNonlinearStaged Interface
ETABSv1 Namespace